OpenAtomFoundation/TobudOS/platform/vendor_bsp/gd/GD32F1x0_Firmware_Library_v3.1.0/GD32F1x0_standard_peripheral/Include/gd32f1x0_rtc.h
/*!
    \file  gd32f1x0_rtc.h
    \brief definitions for the RTC 
*/

/*
    Copyright (C) 2017 GigaDevice

    2014-12-26, V1.0.0, platform GD32F1x0(x=3,5)
    2016-01-15, V2.0.0, platform GD32F1x0(x=3,5,7,9)
    2016-04-30, V3.0.0, firmware update for GD32F1x0(x=3,5,7,9)
    2017-06-19, V3.1.0, firmware update for GD32F1x0(x=3,5,7,9)
*/

#ifndef GD32F1X0_RTC_H
#define GD32F1X0_RTC_H

#include "gd32f1x0.h"

/* RTC definitions */
#define RTC                                RTC_BASE

/* registers definitions */
#define RTC_TIME                           REG32((RTC) + 0x00U)                       /*!< RTC time of day register */
#define RTC_DATE                           REG32((RTC) + 0x04U)                       /*!< RTC date register */
#define RTC_CTL                            REG32((RTC) + 0x08U)                       /*!< RTC control register */
#define RTC_STAT                           REG32((RTC) + 0x0CU)                       /*!< RTC status register */
#define RTC_PSC                            REG32((RTC) + 0x10U)                       /*!< RTC time prescaler register */
#define RTC_ALRM0TD                        REG32((RTC) + 0x1CU)                       /*!< RTC alarm 0 time and date register */
#define RTC_WPK                            REG32((RTC) + 0x24U)                       /*!< RTC write protection key register */
#define RTC_SS                             REG32((RTC) + 0x28U)                       /*!< RTC sub second register */
#define RTC_SHIFTCTL                       REG32((RTC) + 0x2CU)                       /*!< RTC shift function control register */
#define RTC_TTS                            REG32((RTC) + 0x30U)                       /*!< RTC time of timestamp register */
#define RTC_DTS                            REG32((RTC) + 0x34U)                       /*!< RTC date of timestamp register */
#define RTC_SSTS                           REG32((RTC) + 0x38U)                       /*!< RTC sub second of timestamp register */
#define RTC_HRFC                           REG32((RTC) + 0x3CU)                       /*!< RTC high resolution frequency compensation registor */
#define RTC_TAMP                           REG32((RTC) + 0x40U)                       /*!< RTC tamper register */
#define RTC_ALRM0SS                        REG32((RTC) + 0x44U)                       /*!< RTC alarm 0 sub second register */
#define RTC_BKP0                           REG32((RTC) + 0x50U)                       /*!< RTC backup register */
#define RTC_BKP1                           REG32((RTC) + 0x54U)                       /*!< RTC backup register */
#define RTC_BKP2                           REG32((RTC) + 0x58U)                       /*!< RTC backup register */
#define RTC_BKP3                           REG32((RTC) + 0x5CU)                       /*!< RTC backup register */
#define RTC_BKP4                           REG32((RTC) + 0x60U)                       /*!< RTC backup register */

/* bits definitions */
/* RTC_TIME */
#define RTC_TIME_SCU                       BITS(0,3)                                  /*!< second units in BCD code */
#define RTC_TIME_SCT                       BITS(4,6)                                  /*!< second tens in BCD code */
#define RTC_TIME_MNU                       BITS(8,11)                                 /*!< minute units in BCD code */
#define RTC_TIME_MNT                       BITS(12,14)                                /*!< minute tens in BCD code */
#define RTC_TIME_HRU                       BITS(16,19)                                /*!< hour units in BCD code */
#define RTC_TIME_HRT                       BITS(20,21)                                /*!< hour tens in BCD code */
#define RTC_TIME_PM                        BIT(22)                                    /*!< AM/PM notation */

/* RTC_DATE */
#define RTC_DATE_DAYU                      BITS(0,3)                                  /*!< date units in BCD code */
#define RTC_DATE_DAYT                      BITS(4,5)                                  /*!< date tens in BCD code */
#define RTC_DATE_MONU                      BITS(8,11)                                 /*!< month units in BCD code */
#define RTC_DATE_MONT                      BIT(12)                                    /*!< month tens in BCD code */
#define RTC_DATE_DOW                       BITS(13,15)                                /*!< day of week units */
#define RTC_DATE_YRU                       BITS(16,19)                                /*!< year units in BCD code */
#define RTC_DATE_YRT                       BITS(20,23)                                /*!< year tens in BCD code */

/* RTC_CTL */
#define RTC_CTL_TSEG                       BIT(3)                                     /*!< valid event edge of time-stamp */
#define RTC_CTL_REFEN                      BIT(4)                                     /*!< reference clock detection function enable */
#define RTC_CTL_BPSHAD                     BIT(5)                                     /*!< shadow registers bypass control */
#define RTC_CTL_CS                         BIT(6)                                     /*!< display format of clock system */
#define RTC_CTL_ALRM0EN                    BIT(8)                                     /*!< alarm function enable */
#define RTC_CTL_TSEN                       BIT(11)                                    /*!< time-stamp function enable */
#define RTC_CTL_ALRM0IE                    BIT(12)                                    /*!< RTC alarm interrupt enable */
#define RTC_CTL_TSIE                       BIT(15)                                    /*!< time-stamp interrupt enable */
#define RTC_CTL_A1H                        BIT(16)                                    /*!< add 1 hour(summer time change) */
#define RTC_CTL_S1H                        BIT(17)                                    /*!< subtract 1 hour(winter time change) */
#define RTC_CTL_DSM                        BIT(18)                                    /*!< daylight saving mark */
#define RTC_CTL_COS                        BIT(19)                                    /*!< calibration output selection */
#define RTC_CTL_OPOL                       BIT(20)                                    /*!< output polarity */
#define RTC_CTL_OS                         BITS(21,22)                                /*!< output selection */
#define RTC_CTL_COEN                       BIT(23)                                    /*!< calibration output enable */

/* RTC_STAT */
#define RTC_STAT_ALRM0WF                   BIT(0)                                     /*!< alarm configuration can be write flag */
#define RTC_STAT_SOPF                      BIT(3)                                     /*!< shift function operation pending flag */
#define RTC_STAT_YCM                       BIT(4)                                     /*!< year configuration mark status flag */
#define RTC_STAT_RSYNF                     BIT(5)                                     /*!< register synchronization flag */
#define RTC_STAT_INITF                     BIT(6)                                     /*!< initialization state flag */
#define RTC_STAT_INITM                     BIT(7)                                     /*!< enter initialization mode */
#define RTC_STAT_ALRM0F                    BIT(8)                                     /*!< alarm occurs flag */
#define RTC_STAT_TSF                       BIT(11)                                    /*!< time-stamp flag */
#define RTC_STAT_TSOVRF                    BIT(12)                                    /*!< time-stamp overflow flag */
#define RTC_STAT_TP0F                      BIT(13)                                    /*!< RTC tamp 0 detected flag */
#define RTC_STAT_TP1F                      BIT(14)                                    /*!< RTC tamp 1 detected flag */
#define RTC_STAT_SCPF                      BIT(16)                                    /*!< recalibration pending flag */

/* RTC_PSC */
#define RTC_PSC_FACTOR_S                   BITS(0,14)                                 /*!< synchronous prescaler factor */
#define RTC_PSC_FACTOR_A                   BITS(16,22)                                /*!< asynchronous prescaler factor */

/* RTC_ALRM0TD */
#define RTC_ALRM0TD_SCU                    BITS(0,3)                                  /*!< second units in BCD code */
#define RTC_ALRM0TD_SCT                    BITS(4,6)                                  /*!< second tens in BCD code */
#define RTC_ALRM0TD_MSKS                   BIT(7)                                     /*!< alarm second mask bit */
#define RTC_ALRM0TD_MNU                    BITS(8,11)                                 /*!< minutes units in BCD code */
#define RTC_ALRM0TD_MNT                    BITS(12,14)                                /*!< minutes tens in BCD code */
#define RTC_ALRM0TD_MSKM                   BIT(15)                                    /*!< alarm minutes mask bit */
#define RTC_ALRM0TD_HRU                    BITS(16,19)                                /*!< hour units in BCD code */
#define RTC_ALRM0TD_HRT                    BITS(20,21)                                /*!< hour units in BCD code */
#define RTC_ALRM0TD_PM                     BIT(22)                                    /*!< AM/PM flag */
#define RTC_ALRM0TD_MSKH                   BIT(23)                                    /*!< alarm hour mask bit */
#define RTC_ALRM0TD_DAYU                   BITS(24,27)                                /*!< date units or week day in BCD code */
#define RTC_ALRM0TD_DAYT                   BITS(28,29)                                /*!< date tens in BCD code */
#define RTC_ALRM0TD_DOWS                   BIT(30)                                    /*!< day of week  selection */
#define RTC_ALRM0TD_MSKD                   BIT(31)                                    /*!< alarm date mask bit */

/* RTC_WPK */
#define RTC_WPK_WPK                        BITS(0,7)                                  /*!< key for write protection */

/* RTC_SS */
#define RTC_SS_SSC                         BITS(0,15)                                 /*!< sub second value */

